hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
// @file web_common.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief Shared web admin helpers: HTTP Basic authentication, request body
// reading, URL-decoded form field extraction, and the common HTML chrome (page
// header/footer, fieldsets, form controls) and stylesheet used by every admin
// page.

#include "web_common.h"
#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h> // strncasecmp (multipart header parsing)

#include "app_config.h"
#include "aprs_coord.h"                         // aprs_symbol_table_is_valid()/aprs_symbol_code_is_valid(): the symbol pair accepted on air
#include "aprs_service.h"                       // APRS_SOFTWARE_NAME: the firmware name shown as the HTTP auth realm and page title
#include "esp32idf_radioamateur_modem_config.h" // MODEM_ADC_GPIO/MODEM_DAC_GPIO/MODEM_PTT_GPIO: fixed audio front-end + PTT pins for the GPIO registry
#include "esp_log.h"
#include "esp_timer.h"         // esp_timer_get_time(): monotonic clock for the login lockout window
#include "gps.h"               // GPS_UART_RX_GPIO/TX_GPIO: fixed pins for the GPIO registry
#include "lwip/sockets.h"      // getpeername(): client IP for the per-source login lockout
#include "sensors_local_i2c.h" // SENSORS_LOCAL_I2C_SDA_GPIO/SCL_GPIO: fixed pins for the GPIO registry
#include "str_append.h"        // str_is_line_break_char()
#include "translations.h"
#include "web_base64.h" // web_base64_decode(): local RFC 4648 decoder for the Basic auth credential pair
#include "web_help.h"   // web_help_for_label()/web_help_markup(): the question mark that closes every option label

static const char *TAG = "web_common";

// Compares two NUL-terminated strings in time that depends only on the
// longer string's length, not on where the first mismatch occurs. Still
// compares content byte-for-byte (including each string's own terminator),
// so behaves like strcmp()==0 for correctness purposes.
static bool web_const_time_streq(const char *a, const char *b) {
    size_t la = strlen(a), lb = strlen(b);
    unsigned char diff = (la != lb) ? 1 : 0;
    size_t n = la > lb ? la : lb;
    for (size_t i = 0; i < n; i++) {
        unsigned char ca = (i < la) ? (unsigned char)a[i] : 0;
        unsigned char cb = (i < lb) ? (unsigned char)b[i] : 0;
        diff |= (unsigned char)(ca ^ cb);
    }
    return diff == 0;
}

// ------------------------------------------------------- Login rate limiting
//
// Tracks failed Basic-Auth attempts per client IP so an attacker on the
// network can't brute-force the admin password at full HTTP round-trip
// speed. After WEB_AUTH_MAX_ATTEMPTS consecutive failures from the same
// source, that source is locked out for a backoff window that doubles with
// every further failure while locked out (capped at WEB_AUTH_LOCKOUT_MAX_S),
// and resets on a successful login. This is intentionally a small fixed-size
// in-RAM table (no persistent storage / no dynamic allocation) sized for a
// handful of concurrent offenders, which is appropriate for a single-board
// admin UI.
#define WEB_AUTH_MAX_ATTEMPTS   5   // failures allowed before the first lockout
#define WEB_AUTH_LOCKOUT_BASE_S 5   // initial lockout duration
#define WEB_AUTH_LOCKOUT_MAX_S  300 // cap on the backoff (5 minutes)
#define WEB_AUTH_TRACK_SLOTS    16  // distinct source IPs tracked at once

typedef struct {
    uint32_t ip;          // source IPv4 address in network byte order; 0 = free slot
    uint16_t fail_count;  // consecutive failures since the last success/reset
    int64_t locked_until; // esp_timer_get_time() microseconds; 0 = not locked
} web_auth_track_t;

static web_auth_track_t s_auth_track[WEB_AUTH_TRACK_SLOTS];

// Best-effort client IPv4 lookup for the connection behind req. Returns 0
// (never a valid unicast source) if it can't be determined, in which case the
// caller tracks that request under the shared "unknown" bucket instead of
// skipping rate limiting altogether. IPv4-only: this project builds with
// CONFIG_LWIP_IPV6 disabled (see sdkconfig), so the httpd socket is always
// plain AF_INET.
static uint32_t web_client_ipv4(httpd_req_t *req) {
    int sockfd = httpd_req_to_sockfd(req);
    if (sockfd < 0)
        return 0;

    struct sockaddr_in addr;
    socklen_t addr_len = sizeof(addr);
    if (getpeername(sockfd, (struct sockaddr *)&addr, &addr_len) != 0)
        return 0;
    if (addr.sin_family != AF_INET)
        return 0;

    return addr.sin_addr.s_addr;
}

// Finds this source's tracking slot, evicting the least-recently-failed
// entry if the table is full and the source isn't already present. Never
// returns NULL: worst case every source beyond WEB_AUTH_TRACK_SLOTS shares
// slot 0's counter, which only makes lockouts trigger sooner, never later.
static web_auth_track_t *web_auth_track_find(uint32_t ip) {
    web_auth_track_t *free_slot = NULL;
    web_auth_track_t *oldest = &s_auth_track[0];
    for (int i = 0; i < WEB_AUTH_TRACK_SLOTS; i++) {
        if (s_auth_track[i].ip == ip && s_auth_track[i].fail_count > 0)
            return &s_auth_track[i];
        if (!free_slot && s_auth_track[i].ip == 0)
            free_slot = &s_auth_track[i];
        if (s_auth_track[i].locked_until < oldest->locked_until)
            oldest = &s_auth_track[i];
    }
    if (free_slot) {
        free_slot->ip = ip;
        return free_slot;
    }
    oldest->ip = ip;
    oldest->fail_count = 0;
    oldest->locked_until = 0;
    return oldest;
}

// Returns the seconds remaining in this source's lockout (0 if not locked).
// A lockout whose window has just elapsed is rearmed here at one failure
// below the threshold rather than left at its accumulated fail_count: a
// source that keeps presenting the same stale credentials after every
// window expires this way re-triggers only the base lockout duration each
// time, instead of resuming the exponential backoff from wherever it left
// off and ratcheting straight to the cap.
static int web_auth_lockout_remaining_s(uint32_t ip) {
    for (int i = 0; i < WEB_AUTH_TRACK_SLOTS; i++) {
        if (s_auth_track[i].ip == ip && s_auth_track[i].locked_until > 0) {
            int64_t remaining_us = s_auth_track[i].locked_until - esp_timer_get_time();
            if (remaining_us > 0)
                return (int)(remaining_us / 1000000) + 1;
            s_auth_track[i].locked_until = 0;
            s_auth_track[i].fail_count = WEB_AUTH_MAX_ATTEMPTS - 1;
            return 0;
        }
    }
    return 0;
}

