hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
// Copy a label or legend into `dst` for rendering, keeping at most
// WEB_LABEL_MAX_BYTES bytes of it. The translation tables are UTF-8, so an
// accented Spanish or Italian character spends two bytes; cutting at a fixed
// byte count could leave a dangling lead or continuation byte that renders as
// a replacement glyph. Backing up over any trailing continuation bytes
// (0b10xxxxxx) and then over their lead byte keeps the copy valid text.
// Every emitter below routes its label through this, so one over-long label
// cannot render differently depending on which control it lands in.
static void label_clamp(char dst[WEB_LABEL_MAX_BYTES + 1], const char *src) {
    if (!src) {
        dst[0] = 0;
        return;
    }
    size_t n = strlen(src);
    if (n > WEB_LABEL_MAX_BYTES) {
        n = WEB_LABEL_MAX_BYTES;
        while (n > 0 && ((unsigned char)src[n] & 0xC0) == 0x80)
            n--;
    }
    memcpy(dst, src, n);
    dst[n] = 0;
}

// Resolves an option's help text from its label and renders the marker for
// it. Every emitter below routes its label through this, so the question mark
// is part of what a labelled control is rather than something a page has to
// remember to ask for, and a label shared by several pages carries the same
// explanation on all of them. A label with no registered help - one assembled
// at run time, for instance - leaves `dst` empty and the option renders
// without a marker.
static void label_help(char dst[WEB_HELP_MARKUP_MAX], const char *label) {
    web_help_markup(dst, WEB_HELP_MARKUP_MAX, web_help_for_label(label));
}

void web_fieldset_open(httpd_req_t *req, const char *legend) {
    char leg[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(leg, legend);
    char buf[WEB_LABEL_MAX_BYTES + 64];
    snprintf(buf, sizeof(buf), "<fieldset><legend>" WEB_LABEL_FMT "</legend>", leg);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_fieldset_close(httpd_req_t *req) {
    httpd_resp_sendstr_chunk(req, "</fieldset>");
}

// Both helpers below render arbitrary, saved user/attacker text (e.g.
// free-text comments, or a WiFi SSID copied from an over-the-air scan
// result) back into an HTML attribute on every GET of the owning page. That
// text is HTML-escaped here, once, so no caller has to remember to do it:
// escaping at only some call sites would let a quote/angle-bracket character
// in a comment, status, filter, hostname or WiFi SSID field break out of
// value='...' and inject markup/script that then ran in the admin's
// authenticated session on the next page load.
void web_field_text(httpd_req_t *req, const char *label, const char *name, const char *value, int maxlen) {
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    web_field_text_h(req, label, name, value, maxlen, hlp);
}

// The `_h()` variants below all take the help marker ready-rendered instead of
// resolving it from the label. A page reaches for one where its label is built
// at run time - a numbered alias or budlist row, a payload-type filter - since
// such a label matches no entry in the help table and would otherwise render
// with no question mark at all.
void web_field_text_h(httpd_req_t *req, const char *label, const char *name, const char *value, int maxlen, const char *help_markup) {
    char esc[512];
    web_html_attr_escape(value ? value : "", esc, sizeof(esc));
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 576];
    snprintf(buf, sizeof(buf), "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label><input type='text' name='%.30s' value='%.400s' maxlength='%d'>", lbl,
             help_markup ? help_markup : "", name, esc, maxlen);
    httpd_resp_sendstr_chunk(req, buf);
}

// Both numeric emitters below always render the field's accepted range as HTML
// min/max attributes, so every numeric input on every page is validated by the
// browser before the form is submitted. The bounds are supplied by the caller
// because they belong to the field's own value domain, and the caller is what
// also clamps the posted value server-side: the browser check is the first
// line of defence against a typo, the handler's clamp is the one that holds
// against a crafted POST.

// Number of digits after the decimal point in a step string such as "0.0001"
// or "1" (0 digits). Returns 6 for "any" (the HTML5 sentinel meaning
// unrestricted precision) or for a value with a decimal point but no digits
// after it, since those are the only two callers that want full float
// precision rather than a fixed decimal count.
static int step_decimals(const char *step) {
    if (!step || strcmp(step, "any") == 0)
        return 6;
    const char *dot = strchr(step, '.');
    if (!dot)
        return 0;
    int n = 0;
    for (const char *p = dot + 1; *p >= '0' && *p <= '9'; p++)
        n++;
    return n > 0 ? n : 6;
}

void web_field_int(httpd_req_t *req, const char *label, const char *name, long value, long min, long max) {
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    web_field_int_h(req, label, name, value, min, max, hlp);
}

void web_field_int_h(httpd_req_t *req, const char *label, const char *name, long value, long min, long max, const char *help_markup) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 192];
    snprintf(buf, sizeof(buf), "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label><input type='number' name='%.30s' value='%ld' min='%ld' max='%ld'>", lbl,
             help_markup ? help_markup : "", name, value, min, max);
    httpd_resp_sendstr_chunk(req, buf);
}

// Renders the value with exactly as many decimal digits as the step
// attribute itself specifies (e.g. step="0.0001" -> 4 decimals, step="1" ->
// 0 decimals). A field pre-filled with fewer significant digits than that -
// the failure mode of a plain "%g", which drops to 3 decimals past 100 - or
// with more decimals than the step allows leaves a value the browser's own
// step check rejects, blocking every subsequent Save until the field is
// retyped by hand.
void web_field_float(httpd_req_t *req, const char *label, const char *name, float value, const char *step, float min, float max) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    int decimals = step_decimals(step);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 192];
    snprintf(buf, sizeof(buf), "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label><input type='number' step='%.10s' name='%.30s' value='%.*f' min='%g' max='%g'>",
             lbl, hlp, step ? step : "0.01", name, decimals, (double)value, (double)min, (double)max);
    httpd_resp_sendstr_chunk(req, buf);
}

// Renders as an iOS-style toggle switch (track+knob) driven purely by
// :checked in CSS: the extra <span> wrappers around the input are decorative
// only, and the field's name/checked semantics are exactly what a bare
// checkbox would post. Reserved for a checkbox that represents a single on/off
// feature enable; a checkbox that is one of several options in a multi-select
// list uses web_field_checkbox_plain() instead, so it still reads as a list
// rather than a bank of independent switches.
void web_field_checkbox(httpd_req_t *req, const char *label, const char *name, bool checked) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 224];
    snprintf(buf, sizeof(buf),
             "<label class='switch-row'><span class='switch'><input type='checkbox' name='%.30s' %s>"
             "<span class='slider'></span></span><span class='switch-label'>" WEB_LABEL_FMT WEB_HELP_FMT "</span></label>",
             name, checked ? "checked" : "", lbl, hlp);
    httpd_resp_sendstr_chunk(req, buf);
}

// Same field as web_field_checkbox(), rendered as a bare checkbox instead of a
// toggle switch. Used for a checkbox that is one entry in a multi-select list
// (e.g. a payload-type filter or a path alias) rather than a single feature's
// on/off state, since a bank of switches would misrepresent that as several
// independent settings instead of one selection among peers.
void web_field_checkbox_plain(httpd_req_t *req, const char *label, const char *name, bool checked) {
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    web_field_checkbox_plain_h(req, label, name, checked, hlp);
}

void web_field_checkbox_plain_h(httpd_req_t *req, const char *label, const char *name, bool checked, const char *help_markup) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 128];
    snprintf(buf, sizeof(buf), "<label><input type='checkbox' name='%.30s' %s> " WEB_LABEL_FMT WEB_HELP_FMT "</label>", name, checked ? "checked" : "", lbl,
             help_markup ? help_markup : "");
    httpd_resp_sendstr_chunk(req, buf);
}

void web_field_path_checkboxes(httpd_req_t *req, const char *name_prefix, uint8_t mask) {
    char group_help[WEB_HELP_MARKUP_MAX];
    web_help_markup(group_help, sizeof(group_help), web_help_for_label(TR_F_PATH));
    char buf[WEB_HELP_MARKUP_MAX + 160];
    snprintf(buf, sizeof(buf), "<label>%.100s" WEB_HELP_FMT "</label>", TR_F_PATH, group_help);
    httpd_resp_sendstr_chunk(req, buf);

    // Each box's own label is "Path N", optionally followed by the alias that
    // preset currently holds, so it never matches an entry in the help table.
    // All four share one explanation, resolved once here from the group label
    // the boxes sit under.
    char box_help[WEB_HELP_MARKUP_MAX];
    web_help_markup(box_help, sizeof(box_help), web_help_for_label(TR_F_OBJITEM_PATH_FMT));

    char aliases[4][72];
    app_config_lock();
    for (int i = 0; i < 4; i++) {
        strncpy(aliases[i], g_config.path[i], sizeof(aliases[i]) - 1);
        aliases[i][sizeof(aliases[i]) - 1] = 0;
    }
    app_config_unlock();

