hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
    for (int k = 0; k < 4; k++) {
        // Sized to hold the escaped alias plus the "Path N (...)" wrapper so
        // the ESP-IDF -Wformat-truncation error cannot fire; the checkbox
        // helper caps the displayed label length itself.
        char plabel[72 * 6 + 32];
        if (aliases[k][0]) {
            char pesc[72 * 6 + 1];
            web_html_attr_escape(aliases[k], pesc, sizeof(pesc));
            snprintf(plabel, sizeof(plabel), TR_F_OBJITEM_PATH_FMT " (%s)", k + 1, pesc);
        } else {
            snprintf(plabel, sizeof(plabel), TR_F_OBJITEM_PATH_FMT, k + 1);
        }
        char name[48];
        snprintf(name, sizeof(name), "%.30s%d", name_prefix, k + 1);
        web_field_checkbox_plain_h(req, plabel, name, (mask & (1u << k)) != 0, box_help);
    }
}

uint8_t web_form_get_path_mask(const char *body, const char *name_prefix) {
    uint8_t mask = 0;
    for (int k = 0; k < 4; k++) {
        char name[48];
        snprintf(name, sizeof(name), "%.30s%d", name_prefix, k + 1);
        if (web_form_get_bool(body, name))
            mask |= (uint8_t)(1u << k);
    }
    return mask;
}

void web_select_open(httpd_req_t *req, const char *label, const char *name) {
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);
    web_select_open_h(req, label, name, hlp);
}

void web_select_open_h(httpd_req_t *req, const char *label, const char *name, const char *help_markup) {
    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 128];
    snprintf(buf, sizeof(buf), "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label><select name='%.30s'>", lbl, help_markup ? help_markup : "", name);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_select_option(httpd_req_t *req, int value, const char *label, bool selected) {
    web_select_option_state(req, value, label, selected, false);
}

void web_select_option_state(httpd_req_t *req, int value, const char *label, bool selected, bool disabled) {
    char buf[400];
    snprintf(buf, sizeof(buf), "<option value='%d' %s %s>%.300s</option>", value, selected ? "selected" : "", disabled ? "disabled" : "", label);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_select_close(httpd_req_t *req) {
    httpd_resp_sendstr_chunk(req, "</select>");
}

// ---------------------------------------------------------------- GPIO registry
// Every GPIO field g_config currently has, grouped by the feature that owns
// it. This is the ONLY place that mapping lives - a page's GPIO <select>
// never has to know about another page's fields directly, it just asks this
// registry (via web_gpio_owner_tag()) whether a given pin is free.
//
// Entries whose feature has an on/off toggle are only reported while that
// toggle is enabled (a disabled feature doesn't really "hold" its pin); the
// always-on RF module / audio path / message alarm pins, and the sensor
// bus's compile-time-fixed I2C pins, are reported unconditionally.
int web_gpio_collect_used(const char *skip_tag, web_gpio_owner_t *out, int max) {
    int n = 0;

#define WEB_GPIO_ADD(gpio_value, owner_tag)                                                                                                                    \
    do {                                                                                                                                                       \
        int8_t _g = (int8_t)(gpio_value);                                                                                                                      \
        if (n < max && _g >= 0 && (!skip_tag || strcmp((owner_tag), skip_tag) != 0)) {                                                                         \
            out[n].gpio = _g;                                                                                                                                  \
            out[n].tag = (owner_tag);                                                                                                                          \
            n++;                                                                                                                                               \
        }                                                                                                                                                      \
    } while (0)

    // msg_alarm_gpio can hold a real pin number even while the Message Alarm
    // "Enable" checkbox is off (Save doesn't clear it, so re-enabling later
    // keeps the same pin) - only count it as reserved while actually enabled.
    if (g_config.msg_alarm_enable)
        WEB_GPIO_ADD(g_config.msg_alarm_gpio, "Message Alarm");

    // Audio front-end and PTT: all fixed at compile time
    // (esp32idf_radioamateur_modem_config.h / the top-level CMakeLists.txt),
    // always reserved - the modem's ADC/DAC/PTT trio is hardwired on the
    // board. PTT is a compile-time constant like its ADC/DAC siblings and is
    // reported the same way they are - always shown as "used" here so it
    // correctly greys out in every other GPIO picker (e.g. Message Alarm)
    // even though it has no web-admin field of its own.
    WEB_GPIO_ADD(MODEM_ADC_GPIO, "Radio Modem");
    WEB_GPIO_ADD(MODEM_DAC_GPIO, "Radio Modem");
    WEB_GPIO_ADD(MODEM_PTT_GPIO, "PTT");

    // Local sensor I2C bus: fixed at compile time (sensors_local_i2c.h),
    // always reserved regardless of any run-time enable flag and of which
    // sensor drivers are compiled in - the bus belongs to the board's wiring,
    // not to any one chip on it.
    WEB_GPIO_ADD(SENSORS_LOCAL_I2C_SDA_GPIO, "Sensor I2C");
    WEB_GPIO_ADD(SENSORS_LOCAL_I2C_SCL_GPIO, "Sensor I2C");

    // GNSS receiver serial port: fixed at compile time (gps.h), always
    // reserved. Both pins are listed, not just the one carrying sentences:
    // the transmit pin is physically wired to the module's input on this
    // board, so handing it to another peripheral would drive that input.
    WEB_GPIO_ADD(GPS_UART_RX_GPIO, "GPS");
    WEB_GPIO_ADD(GPS_UART_TX_GPIO, "GPS");

#undef WEB_GPIO_ADD
    return n;
}

