hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
const char *web_gpio_owner_tag(int gpio, const char *skip_tag) {
    web_gpio_owner_t used[WEB_GPIO_MAX_OWNERS];
    int n = web_gpio_collect_used(skip_tag, used, WEB_GPIO_MAX_OWNERS);
    for (int i = 0; i < n; i++) {
        if (used[i].gpio == gpio)
            return used[i].tag;
    }
    return NULL;
}

// ---------------------------------------------------------------- Symbol picker
void web_field_symbol(httpd_req_t *req, const char *label, const char *name_prefix, const char *sym2) {
    char table_ch[2] = { (sym2 && sym2[0]) ? sym2[0] : '/', 0 };
    char sym_ch[2] = { (sym2 && sym2[1]) ? sym2[1] : '&', 0 };
    int table_num = (table_ch[0] == '\\') ? 2 : 1;
    int code_num = (int)(unsigned char)sym_ch[0];

    char ids[64];
    snprintf(ids, sizeof(ids), "%.30sTable", name_prefix);
    char idc[64];
    snprintf(idc, sizeof(idc), "%.30sCode", name_prefix);

    char lbl[WEB_LABEL_MAX_BYTES + 1];
    label_clamp(lbl, label);
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, label);

    char buf[WEB_LABEL_MAX_BYTES + WEB_HELP_MARKUP_MAX + 1536];
    snprintf(buf, sizeof(buf),
             "<label>" WEB_LABEL_FMT WEB_HELP_FMT "</label>"
             "<div style='display:flex;gap:6px;align-items:center'>"
             "<span id='%.30s_icn' style='display:inline-flex;align-items:center;justify-content:center;width:34px;height:34px;"
             "border-radius:6px;background:#dcfce7;overflow:hidden;flex:none'>"
             "<img id='%.30s_img' src='http://aprs.dprns.com/symbols/icons/%d-%d.png' width=32 height=32 style='display:block' "
             "onerror=\"this.style.display='none'\">"
             "</span>"
             "<span style='font-size:12px;color:var(--sub)'>%.60s:</span>"
             "<input type='text' id='%.30s' name='%.30s' value='%.4s' maxlength='1' style='width:3em;text-align:center' "
             "oninput=\"aprsSymUpd('%.30s','%.30s')\">"
             "<span style='font-size:12px;color:var(--sub)'>%.60s:</span>"
             "<input type='text' id='%.30s' name='%.30s' value='%.4s' maxlength='1' style='width:3em;text-align:center' "
             "oninput=\"aprsSymUpd('%.30s','%.30s')\">"
             "<a href='/symbol' target='_blank' title='%.60s' class='secondary' style='text-decoration:none;padding:4px 8px'>%.60s</a>"
             "</div>",
             lbl, hlp, name_prefix, name_prefix, code_num, table_num, TR_F_SYMBOL_TABLE, ids, ids, table_ch, ids, idc, TR_F_SYMBOL_CODE, idc, idc, sym_ch, ids,
             idc, TR_SYM_PICK_HINT, TR_BTN_PICK_SYMBOL);
    httpd_resp_sendstr_chunk(req, buf);

    // Tiny helper script: updates the graphical icon live as the user edits
    // the Table/Code inputs, without waiting for a page reload. Safe to emit
    // once per field; browsers just redefine the same function identically.
    static const char *script = "<script>function aprsSymUpd(t,c){"
                                "var tv=(document.getElementById(t).value||'/').charAt(0)||'/';"
                                "var cv=(document.getElementById(c).value||' ').charAt(0)||' ';"
                                "var tn=(tv=='\\\\')?2:1;var cn=cv.charCodeAt(0);"
                                "var pfx=t.slice(0,-5);"
                                "var img=document.getElementById(pfx+'_img');"
                                "if(img){img.style.display='block';img.src='http://aprs.dprns.com/symbols/icons/'+cn+'-'+tn+'.png';}"
                                "}</script>";
    httpd_resp_sendstr_chunk(req, script);
}

void web_form_get_symbol(const char *body, const char *name_prefix, const char *legacy_name, char *out, size_t out_size) {
    if (!out || out_size < 3)
        return;

    char name_t[40], name_c[40];
    snprintf(name_t, sizeof(name_t), "%.30sTable", name_prefix);
    snprintf(name_c, sizeof(name_c), "%.30sCode", name_prefix);

    char t[4] = { 0 }, s[4] = { 0 };
    bool got_t = web_form_get(body, name_t, t, sizeof(t));
    bool got_s = web_form_get(body, name_c, s, sizeof(s));
    if (!got_t && !got_s) {
        char legacy[4] = { 0 };
        if (!legacy_name || !web_form_get(body, legacy_name, legacy, sizeof(legacy)))
            return;
        t[0] = legacy[0];
        s[0] = legacy[1];
    }

    // Both bytes are free text in the form, so they are bounded here as well
    // as in the configuration loader: the table identifier is one of the four
    // forms chapter 21 defines and the code is a printable character the
    // symbol tables are actually indexed by. A byte outside those sets is not
    // cosmetic - a digit in the table position of a compressed report makes
    // every receiver read the report as uncompressed, and a '_' in the code
    // position makes every classifier read the report as weather.
    out[0] = aprs_symbol_table_is_valid(t[0]) ? t[0] : APRS_SYMBOL_TABLE_DEFAULT;
    out[1] = aprs_symbol_code_is_valid(s[0]) ? s[0] : APRS_SYMBOL_CODE_DEFAULT;
    out[2] = 0;
}

void web_field_use_station_data(httpd_req_t *req, const char *checkbox_name, bool checked, const char *call_name, const char *lat_name, const char *lon_name,
                                const char *alt_name) {
    // Build each field's `document.querySelector(...)` expression (or the
    // literal "null" if the page doesn't have that field), then splice all
    // four into the script below in one go.
    char qcall[80] = "null", qlat[80] = "null", qlon[80] = "null", qalt[80] = "null";
    if (call_name)
        snprintf(qcall, sizeof(qcall), "document.querySelector(\"[name='%.30s']\")", call_name);
    if (lat_name)
        snprintf(qlat, sizeof(qlat), "document.querySelector(\"[name='%.30s']\")", lat_name);
    if (lon_name)
        snprintf(qlon, sizeof(qlon), "document.querySelector(\"[name='%.30s']\")", lon_name);
    if (alt_name)
        snprintf(qalt, sizeof(qalt), "document.querySelector(\"[name='%.30s']\")", alt_name);

    // Callsigns only ever contain [A-Z0-9-], so a plain copy into a JS
    // single-quoted string literal is safe here (no escaping needed), unlike
    // arbitrary free-text user input.
    //
    // Latitude/longitude are spliced in with a fixed 4 decimals and altitude
    // with a fixed 1 decimal, matching the step web_field_float() renders for
    // those fields on every page. Formatting with fewer decimals than the
    // field's step (as a plain "%g" does once the value has 3+ integer
    // digits) leaves the field holding a value the browser's own step check
    // rejects, blocking Save until the operator retypes it by hand.
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, TR_USE_MY_STATION_DATA);

    char buf[WEB_HELP_MARKUP_MAX + 2200];
    snprintf(buf, sizeof(buf),
             "<label><input type='checkbox' name='%.30s' id='%.30s' %s> " TR_USE_MY_STATION_DATA WEB_HELP_FMT "</label>"
             "<script>(function(){"
             "function apply(){"
             "var cb=document.getElementById('%.30s');if(!cb)return;"
             "var on=cb.checked;"
             "var call=%s,lat=%s,lon=%s,alt=%s;"
             "if(call){if(on)call.value='%.9s';call.disabled=on;}"
             "if(lat){if(on)lat.value='%.4f';lat.disabled=on;}"
             "if(lon){if(on)lon.value='%.4f';lon.disabled=on;}"
             "if(alt){if(on)alt.value='%.1f';alt.disabled=on;}"
             "}"
             "document.addEventListener('DOMContentLoaded',function(){"
             "var cb=document.getElementById('%.30s');if(cb){cb.addEventListener('change',apply);apply();}"
             "});"
             "})();</script>",
             checkbox_name, checkbox_name, checked ? "checked" : "", hlp, checkbox_name, qcall, qlat, qlon, qalt, g_config.my_callsign, (double)g_config.my_lat,
             (double)g_config.my_lon, (double)g_config.my_alt, checkbox_name);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_field_use_gps_data(httpd_req_t *req, const char *checkbox_name, bool checked, const char *station_checkbox_name, const char *lat_name,
                            const char *lon_name, const char *alt_name, const char *speed_name, const char *course_name) {
    // Same "querySelector or literal null" splice web_field_use_station_data()
    // uses, extended with the two motion fields that only some pages have.
    char qlat[80] = "null", qlon[80] = "null", qalt[80] = "null", qspeed[80] = "null", qcourse[80] = "null";
    if (lat_name)
        snprintf(qlat, sizeof(qlat), "document.querySelector(\"[name='%.30s']\")", lat_name);
    if (lon_name)
        snprintf(qlon, sizeof(qlon), "document.querySelector(\"[name='%.30s']\")", lon_name);
    if (alt_name)
        snprintf(qalt, sizeof(qalt), "document.querySelector(\"[name='%.30s']\")", alt_name);
    if (speed_name)
        snprintf(qspeed, sizeof(qspeed), "document.querySelector(\"[name='%.30s']\")", speed_name);
    if (course_name)
        snprintf(qcourse, sizeof(qcourse), "document.querySelector(\"[name='%.30s']\")", course_name);

    char qstation[80] = "null";
    if (station_checkbox_name)
        snprintf(qstation, sizeof(qstation), "document.getElementById('%.30s')", station_checkbox_name);

    // Sized for the worst case of this format string: the static markup and
    // script text plus thirteen %s splices (each up to 79 bytes, from the
    // qlat/qlon/qalt/qspeed/qcourse/qstation buffers), four %.30s splices and
    // the label's help marker, rounded up with headroom so the compiler can
    // prove no truncation.
    //
    // fill() rounds each live GPS reading to the precision the destination
    // field's own step attribute accepts before writing it into that field:
    // latitude/longitude to 4 decimals and altitude to 1 decimal. The
    // browser only lets a form submit when every filled value already
    // conforms to its field's step, so writing a value with more decimals
    // than the field's step allows (as the raw /gps/live latitude/longitude,
    // at 6 decimals, would be here) would leave the field populated but
    // silently blocking Save.
    char hlp[WEB_HELP_MARKUP_MAX];
    label_help(hlp, TR_USE_GPS_DATA);

    char buf[WEB_HELP_MARKUP_MAX + 2700];
    snprintf(buf, sizeof(buf),
             "<label><input type='checkbox' name='%.30s' id='%.30s' %s> " TR_USE_GPS_DATA WEB_HELP_FMT "</label>"
             "<script>(function(){"
             "var timer=null;"
             "function setDisabled(on){"
             "var lat=%s,lon=%s,alt=%s,speed=%s,course=%s;"
             "if(lat)lat.disabled=on;if(lon)lon.disabled=on;if(alt)alt.disabled=on;if(speed)speed.disabled=on;if(course)course.disabled=on;"
             "}"
             "function fill(v){"
             "var lat=%s,lon=%s,alt=%s,speed=%s,course=%s;"
             "if(lat&&v.lat!==null&&v.lat!==undefined)lat.value=Number(v.lat).toFixed(4);"
             "if(lon&&v.lon!==null&&v.lon!==undefined)lon.value=Number(v.lon).toFixed(4);"
             "if(alt&&v.alt!==null&&v.alt!==undefined)alt.value=Number(v.alt).toFixed(1);"
             "if(speed&&v.speed!==null&&v.speed!==undefined)speed.value=v.speed;"
             "if(course&&v.course!==null&&v.course!==undefined)course.value=v.course;"
             "}"
             "function poll(){"
             "fetch('/gps/live').then(function(r){return r.json();}).then(fill).catch(function(){});"
             "}"
             "function apply(){"
             "var cb=document.getElementById('%.30s');if(!cb)return;"
             "var on=cb.checked;"
             "setDisabled(on);"
             "if(timer){clearInterval(timer);timer=null;}"
             "if(on){"
             "var station=%s;if(station&&station.checked){station.checked=false;station.dispatchEvent(new Event('change'));}"
             "poll();timer=setInterval(poll,1000);"
             "}"
             "}"
             "document.addEventListener('DOMContentLoaded',function(){"
             "var cb=document.getElementById('%.30s');if(!cb)return;"
             "cb.addEventListener('change',apply);"
             "var station=%s;"
             "if(station)station.addEventListener('change',function(){if(station.checked&&cb.checked){cb.checked=false;apply();}});"
             "apply();"
             "});"
             "window.addEventListener('beforeunload',function(){if(timer)clearInterval(timer);});"
             "})();</script>",
             checkbox_name, checkbox_name, checked ? "checked" : "", hlp, qlat, qlon, qalt, qspeed, qcourse, qlat, qlon, qalt, qspeed, qcourse, checkbox_name,
             qstation, checkbox_name, qstation);
    httpd_resp_sendstr_chunk(req, buf);
}
